# FilterDialog Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterDialog Constructor
FilterDialog Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterDialog(Document, ElementId) | Constructs a new instance of the FilterDialog class, while setting the id of the FilterElement to be selected when the dialog is shown. |
| FilterDialog(Document, String) | Constructs a new instance of the FilterDialog class, while setting the name of the new ParameterFilterElement to be created and selected for editing. |

# See Also
FilterDialog Class
FilterDialog Members
Autodesk.Revit.UI Namespace